# Taps
tap "buo/cask-upgrade"

# JIRA
tap "atlassian/homebrew-acli"
brew "atlassian/homebrew-acli/acli"

# Core Utilities
brew "bash"                    # Modern Bash shell
brew "gnu-sed"                 # GNU sed (gsed)
brew "openssl"                 # Cryptography and SSL/TLS toolkit
brew "rsync"                   # Fast file copying tool
brew "the_silver_searcher"     # ag - fast code searching
brew "tree"                    # Display directory structure
brew "wget"                    # Non-interactive network downloader

# Development Tools
brew "automake"                # Makefile generator
brew "bfg"                     # Remove large files from Git history
brew "dotnet"                  # .NET SDK
brew "fx"                      # JSON viewer and processor
brew "gh"                      # GitHub CLI
brew "git"                     # Distributed version control
brew "git-delta"               # Syntax-highlighting pager for git/diff
brew "git-filter-repo"         # Fast, flexible tool for rewriting git history
brew "git-lfs"                 # Git Large File Storage
brew "glow"                    # Terminal markdown renderer
brew "graphviz"                # Graph visualization software
brew "libmagic"                # File type identification
brew "libvips"                 # Image processing library (for Astro)
brew "libyaml"                 # YAML parser (for Ruby)
brew "multimarkdown"           # Markdown processor
brew "swig"                    # Interface compiler

# Shell & Terminal Enhancements
brew "autojump"                # Smart directory navigation
brew "bash-completion@2"       # Bash completion scripts
brew "fd"                      # Modern find replacement
brew "fzf"                     # Command-line fuzzy finder
brew "m-cli"                   # macOS command-line tools
brew "mise"                    # Polyglot runtime version manager
brew "pam-reattach"            # Touch ID support for tmux
brew "reattach-to-user-namespace" # macOS clipboard support for tmux
brew "ripgrep"                 # Modern grep replacement
brew "starship"                # Cross-shell prompt
brew "stow"                    # Symlink farm manager
brew "tmux"                    # Terminal multiplexer

# Editor Tools
brew "luarocks"                # Lua package manager (for Neovim)
brew "neovim"                  # Hyperextensible Vim-based text editor
cask "vimr"                    # Neovim GUI for macOS

# Miscellaneous CLI Tools
brew "asciinema"               # Record terminal sessions
brew "cloc"                    # Count lines of code
brew "czkawka"                 # Find duplicates, empty folders, similar images
brew "gollama"                 # Ollama GUI/TUI
brew "httpie"                  # User-friendly HTTP client
brew "ollama"                  # Run LLMs locally
brew "pwgen"                   # Password generator
brew "qpdf"                    # PDF manipulation tools
brew "ssh-copy-id"             # Install SSH keys on remote servers
brew "terminal-notifier"       # Send macOS notifications from command line
brew "trash"                   # Move files to trash
brew "wdiff"                   # Word-diff between text files
brew "zizmor"                  # GitHub Actions security analyzer

# Quick Look Plugins
cask "qlimagesize"             # Display image size and resolution
cask "qlmarkdown"              # Preview Markdown files
cask "qlstephen"               # Preview plain text files without extension
cask "qlvideo"                 # Preview video thumbnails
cask "quicklook-json"          # Preview JSON files

# GUI Applications

# Productivity & Utilities
cask "1password", greedy: true
cask "1password-cli", greedy: true
cask "alfred", greedy: true    # Application launcher and productivity
cask "jordanbaird-ice"        # Menu bar management
cask "betterdisplay", greedy: true # Display management
cask "cheatsheet"              # Display active app shortcuts
cask "focusatwill"             # Focus music
cask "keepingyouawake"         # Prevent sleep
cask "keyboardcleantool"       # Disable keyboard for cleaning
cask "libreoffice"             # Open-source office suite
cask "mactracker"              # Apple hardware database
cask "menuwhere"               # Access menu bar with hotkey
cask "moom"                    # Window management
cask "pester"                  # Simple timer/reminder
cask "soundsource", greedy: true # Audio routing

# Web Browsers
cask "arc", greedy: true        # Innovative web browser
cask "firefox"                 # Mozilla Firefox browser
cask "google-chrome"           # Google Chrome browser
cask "ungoogled-chromium", args: { no_quarantine: true } # Open-source Chrome (for prisma-erd-generator)

# Communication
cask "discord"
cask "microsoft-teams"
cask "signal"                  # Encrypted messaging
cask "slack", greedy: true
cask "whatsapp"
cask "zoom", greedy: true

# Development Tools
cask "chatgpt"                 # OpenAI ChatGPT desktop
cask "claude"                  # Anthropic Claude desktop
cask "dbeaver-community", greedy: true # Database management
cask "docker-desktop", greedy: true
cask "ghostty", greedy: true   # GPU-accelerated terminal
cask "helpwire-operator"       # Helpwire operator
cask "linear-linear"           # Linear project management
cask "lm-studio"               # Run LLMs locally
cask "ngrok"                   # Secure tunnels to localhost
cask "p4v", greedy: true       # Perforce visual client
cask "rapidapi"                # API testing client
cask "sourcetree", greedy: true # Git GUI

# File & System Management
cask "appcleaner"              # App uninstaller
cask "carbon-copy-cloner", greedy: true # Backup solution
cask "coconutbattery"          # Battery health
cask "cyberduck"               # FTP/SFTP browser
cask "daisydisk"               # Disk space analyzer
cask "dropbox", greedy: true
cask "google-drive"
cask "istat-menus", greedy: true # System statistics
cask "micro-snitch"            # Monitor camera/microphone usage
cask "pearcleaner"             # Advanced app cleaner
cask "sloth"                   # Display open files/sockets
cask "the-unarchiver"          # Archive extraction

# Media & Notes
cask "fsnotes", greedy: true   # Markdown notes manager
cask "imageoptim"              # Image optimization
cask "macwhisper", greedy: true # Local audio transcription
cask "marked-app", greedy: true # Markdown preview
cask "notion"                  # All-in-one workspace
cask "screenflow"              # Screen recording
cask "shottr"                  # Screenshot tool
cask "taskpaper"               # Plain text task management
cask "vlc"                     # Media player

# Fonts
cask "font-sauce-code-pro-nerd-font"

# Alternative Nerd Font Options:
# cask "font-jetbrains-mono-nerd-font"     # Popular monospace font
# cask "font-fira-code-nerd-font"          # With ligatures
# cask "font-cascadia-code-nerd-font"      # Microsoft's font
# cask "font-inconsolata-lgc-nerd-font"    # Classic programming font
# cask "font-hasklug-nerd-font"            # Hasklig variant
# cask "font-droid-sans-mono-nerd-font"    # Android's monospace
# cask "font-blex-mono-nerd-font"          # IBM Plex Mono variant
# cask "font-anonymice-nerd-font"          # Anonymous Pro variant
