# Taps
tap "buo/cask-upgrade"

# Core Utilities & Replacements
brew "bash" # Better version of Mac built-in
brew "gnu-sed" # Better version of Mac built-in
brew "openssl"
brew "rsync" # Better version of Mac built-in
brew "the_silver_searcher" # Better version of Mac built-in `grep`
brew "tree"
brew "wget"

# Development Tools
brew "automake"
brew "bfg" # Git repo cleaner
brew "fx"
brew "gh" # GitHub CLI
brew "git"
brew "git-delta" # Syntax-highlighting pager for git, diff, and grep output
brew "git-lfs"
brew "graphviz"
brew "libmagic" # Needed for file magic
brew "libvips" # Needed for node sharp (astro)
brew "libyaml" # Needed for Ruby compilation
brew "multimarkdown"
brew "swig"

# Shell & Terminal Enhancements
brew "autojump" # Directory navigation
brew "bash-completion@2"
brew "eza" # Modern replacement for ls
brew "fd" # Simple, fast and user-friendly alternative to find
brew "fzf" # Command-line fuzzy finder
brew "m-cli" # macOS command-line tools
brew "mise" # Polyglot tool version manager
brew "pam-reattach" # tmux PAM reattach for Touch ID
brew "reattach-to-user-namespace" # tmux copy and paste
brew "starship" # Cross-shell prompt
brew "stow" # Symlink farm manager
brew "tmux" # Terminal multiplexer

# Neovim & Editor Tools
brew "luarocks" # Lua package manager
brew "neovim"
brew "ripgrep" # Line-oriented search tool (dependency for Telescope etc)
cask "vimr" # Refined Vim Experience for OS X

# Miscellaneous CLI Tools
brew "czkawka" # Multi functional app to find duplicates, empty folders, similar images etc.
brew "gollama"
brew "httpie" # Modern command-line HTTP client
brew "ollama" # Run large language models locally
brew "pwgen" # Password generator
brew "qpdf" # Tools for working with PDF files
brew "ssh-copy-id"
brew "trash" # Move files and folders to the trash
brew "wdiff" # Display word differences between text files

# Quick Look Plugins
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen" # Preview plain text files without extension
cask "qlvideo"
cask "quicklook-json"

# GUI Applications
cask "1password", greedy: true
cask "1password-cli", greedy: true
cask "alfred", greedy: true
cask "appcleaner"
cask "arc", greedy: true
cask "bartender", greedy: true
cask "betterdisplay", greedy: true
cask "carbon-copy-cloner", greedy: true
cask "chatgpt"
cask "cheatsheet"
cask "chromium", args: { no_quarantine: true } # Needed for prisma-erd-generator ARM64
cask "claude"
cask "coconutbattery"
cask "cyberduck" # FTP/SFTP browser
cask "daisydisk" # Disk space visualizer
cask "dbeaver-community", greedy: true # Universal database tool
cask "discord"
cask "docker-desktop", greedy: true
cask "dropbox", greedy: true
cask "firefox"
cask "focusatwill" # Background music for focus
cask "fsnotes", greedy: true # Notes manager
cask "ghostty", greedy: true # GPU-accelerated terminal emulator
cask "google-chrome"
cask "google-drive"
cask "imageoptim" # Image optimizer
cask "istat-menus", greedy: true # System monitor
cask "keepingyouawake" # Prevent Mac from sleeping
cask "keyboardcleantool" # Disable keyboard for cleaning
cask "libreoffice"
cask "lm-studio"
cask "mactracker" # Database of Apple hardware/software
cask "macwhisper", greedy: true # Local transcription with OpenAI's Whisper
cask "marked-app", greedy: true # Markdown previewer
cask "menuwhere" # Bring frontmost app's menu bar to mouse location
cask "micro-snitch" # Network monitor
cask "moom" # Window manager
cask "ngrok" # Secure introspectable tunnels to localhost
cask "p4v", greedy: true # Perforce visual client
cask "pearcleaner" # App uninstaller & cleaner
cask "pester" # Simple timer/reminder app
cask "rapidapi" # API client
cask "screenflow" # Screen recording and video editing
cask "shottr" # Screenshot tool
cask "signal" # Secure messenger
cask "slack", greedy: true
cask "sloth" # Show all open files and sockets in use
cask "soundsource", greedy: true # Audio control
cask "sourcetree", greedy: true # Git GUI
cask "taskpaper" # Plain text to-do list manager
cask "the-unarchiver" # Archive unpacker
cask "vlc" # Media player
cask "whatsapp"
cask "zoom", greedy: true

# Fonts
cask "font-sauce-code-pro-nerd-font"

## Other potential font options
# cask "font-anonymice-nerd-font"
# cask "font-blex-mono-nerd-font"
# cask "font-caskaydia-cove-nerd-font"
# cask "font-droid-sans-mono-nerd-font"
# cask "font-fira-code-nerd-font"
# cask "font-hasklug-nerd-font"
# cask "font-inconsolata-lgc-nerd-font"
# cask "font-jetbrains-mono-nerd-font"
