tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/services"

# Better versions of Mac built-ins
brew "bash"
brew "gnu-sed"
brew "rsync"
brew "the_silver_searcher"

# Bash completions
brew "bash-completion@2"

# General development
brew "automake"
brew "bfg"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"

# Needed for magic
brew "libmagic"

# More nice-to-haves and various development tools
brew "autojump"
brew "czkawka"
brew "eza"
brew "fd"
brew "fzf"
brew "graphviz"
brew "httpie"
brew "m-cli"
brew "mise"
brew "multimarkdown"
brew "ollama"
brew "openssl"
brew "pwgen"
brew "qpdf"
brew "ssh-copy-id"
brew "starship"
brew "stow"
brew "swig"
brew "tmux"
brew "trash"
brew "tree"
brew "wdiff"
brew "wget"

# tmux copy and paste
brew "reattach-to-user-namespace"

# tmux PAM reattch for Touch ID
brew "pam-reattach"

# Needed for node sharp (astro)
brew "libvips"

## neovim
brew "luarocks"
brew "neovim"
brew "ripgrep"
cask "vimr"

# Quick Look plugins
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"

# Apps
cask "1password", greedy: true
cask "1password-cli", greedy: true
cask "alfred", greedy: true
cask "appcleaner"
cask "arc", greedy: true
cask "bartender", greedy: true
cask "betterdisplay", greedy: true
cask "carbon-copy-cloner", greedy: true
cask "chatgpt"
cask "cheatsheet"
cask "claude"
cask "coconutbattery"
cask "cyberduck"
cask "daisydisk"
cask "dbeaver-community", greedy: true
cask "discord"
cask "docker", greedy: true
cask "dropbox", greedy: true
cask "firefox"
cask "focusatwill"
cask "fsnotes", greedy: true
cask "ghostty", greedy: true
cask "google-drive"
cask "imageoptim"
cask "istat-menus", greedy: true
cask "keepingyouawake"
cask "keyboardcleantool"
cask "mactracker"
cask "macwhisper", greedy: true
cask "marked", greedy: true
cask "menuwhere"
cask "micro-snitch"
cask "moom"
cask "ngrok"
cask "p4v", greedy: true
cask "pearcleaner"
cask "pester"
cask "rapidapi"
cask "screenflow"
cask "shottr"
cask "signal"
cask "slack", greedy: true
cask "sloth"
cask "soundsource", greedy: true
cask "sourcetree", greedy: true
cask "taskpaper"
cask "the-unarchiver"
cask "vlc"
cask "whatsapp"
cask "zoom", greedy: true

# https://github.com/keonik/prisma-erd-generator#-arm64-users-
cask "chromium", args: { no_quarantine: true }

# Fonts
cask "font-sauce-code-pro-nerd-font"

## Other potential font options
# cask "font-anonymice-nerd-font"
# cask "font-blex-mono-nerd-font"
# cask "font-caskaydia-cove-nerd-font"
# cask "font-droid-sans-mono-nerd-font"
# cask "font-fira-code-nerd-font"
# cask "font-hasklug-nerd-font"
# cask "font-inconsolata-lgc-nerd-font"
# cask "font-jetbrains-mono-nerd-font"
